/* Test */
options results

say
say ">>>>>>>>>>>>>>>>>>>>>>>>>>"
Say '    Hello from Test2.rexx'
say "    >> Any Key <<"
pull a
say "<<<<<<<<<<<<<<<<<<<<<<<<<<"

exit( "Fish Cakes" )
