/* This is a test. Run it with the command: rx updtest.rexx */


address PLAY say "If the example i d file was installed, you will hear my name now."
address PLAY id "AUTHOR"
