/* Arexx Testprogramm für den Abakus Compiler */

open('ax','t:extcode','W')
test=";REXX Test ............................. Test"
writeln('ax',test)
close 'ax'