@database TransCat
@author "zIgUS"
@node "Main" "TransCat_Russian.guide"
@$ver: TransCat_russian guide (Ami1251) 1.21 [01.01.2000]
@remark Перевод: Александр Дышкант <nikolya@bios.iuf.net>

                              @{b}TransCat@{ub} v1.21
                              **************
                               [01.01.2000]


             @{" Авторские  права " link "Copyright"}  Правовая информация о TransCat.
             @{"     Установка    " link "Installation"}  Как устанавливать TransCat.
             @{"     Введение     " link "Introduction"}  Общая информация о TransCat.
             @{"  Использование   " link "Use"}  Как работать с TransCat.
             @{" Дальнейшие планы " link "The Future"}  Будущее TransCat.
             @{" История создания " link "History"}  Этапы создания программы...
             @{"     Перевод      " link "Translation"}  Перевод каталогов.

             @{"      Автор       " link "Contact"}
@EndNode


@Node "Copyright" "Правовая информация о TransCat."

 Внимание :
 ===п

 TransCat - © 1998-1999 by zIgUS. Все права защищены.

 TransCat это Shareware программа. Вы можете @{"зарегистрироваться" link "Registration"}
 за 50 FF, 15 US$ или 25 DM.
 И вы получите полную версию программы.

 Только демо версия может быть свободно распространяема!.

 Условия распространения TransCat: Автор не несёт никаких гарантий и не
 отвечает ни за какие последствия работы данной программы. При любых
 проблемах Автор не может быть привлечён к ответственности (непосредственно
 появление любых неисправностей и/или потеря данных при использовании
 данного программного продукта).
 Всю ответственность при использовании программы берёт на себя ПОЛЬЗОВАТЕЛЬ.

 Все вайлы, находящиеся в данном архиве, не могут быть изменены. Все
 модификации должны проводиться только с согласием Автора.

 Автор известит Вас о своём согласии либо несогласии насчёт изменения
 архива. В противном случае у Вас могут возникнуть некоторые неприятные
 "сюрпризы" и также это нанесёт некоторый ущерю будущим разработкам TransCat.
@EndNode


@Node "Registration" "Регистрация TransCat."

 TransCat - Shareware прграмма.
 Демо-версия имеет некоторые ограничения :

  · Невозможна запись перевода каталога (.ct).
  · Вы не сможете ввести свое имя в .catalog

 Для получения полной версии Вы должны заплатить 50 FF, 15 US$ или 25 DM.

 Вы будете зарегистрированны только в том случае, если Автор сможет
 получить от Вас сумму не менее 50 FF. Если автор получит сумму меньше 
 необходимой, то Вас не зарегистируют, пока Вы не доплатите до необходимой
 суммы.

 Если у Вас есть принтер, используюте регистрационную форму для регистрации
 TransCat.


 Высылайте регистрационную форму по адресу:

      K L A X
      P.O Box 14
      21601 Longvic CEDEX
      France


 Регистрация будет выполнена в как можно наибыстрые сроки.

 Также Автор благодарит Вас за поддержку его работы.
 Запомните: Покупая программное обеспечение - вы стимулируете его
 дальнейшую разработку!
@EndNode

@Node "Installation" "Kaк ycтaнaвливaть TransCat"

 @{b}Installation@{ub}

 Ничего сложного!

 Только скопируйте fgl.library в LIBS: каталог, а всё остальное - куда
 хотите.

@EndNode

@Node "Introduction" "Oбщaя инфopмaция"

  Программист zIgUS  © 1998-1999
  TransCat запускается только A1200 (либо выше).


  TransCat использует следующие билиотеки :

      - fgl.library
      - asl.library

  Текже необходим @{"MUI" link "mui"} 3.6 или выше.

  TransCat состоит из 100% машинного кода. Если Вы обнаружите какие-либо
 глюки или у Вас есть идеи по усовершенствованию программы, то обратитесь
 к @{"Автору" link "Contact"}.

@EndNode

@Node "MUI" "Инфомация о MUI..."


                          @{b}MUI - MagicUserInterface@{ub}

                   (c) Copyright 1993/97 de Stefan Stuntz


 MUI - система для конфигурации Графического Интерфейса Пользователя (ГИП).
 С её помощью пользователь может контролировать и настраивать любое
 программное обеспечение, пользующееся данной системой, по своему вкусу.

 MUI  - свободно распространяемый пакет (например, AmiNet). Для полноценной
 работы, MUI необходимо зарегистрировать.

      Если Вы согласны зарегистрировать MUI, то вышлите:


                   30 немецких марок. - или 20 ам. долларов

                                  по адресу

                                Stefan Stuntz
                          Eduard-Spranger-StraЯe 7
                                80935 Mьnchen
                                   GERMANY
@EndNode

@Node "Use" "Kaк paбoтaть c TransCat."
                        _          ._______  ___       .--.__ 
                       Ў¬\         |      / Ў  ¬\_____ |  ¦ ¬|
                       | _\  /\    ¦  ___/  |    \   / |  |  |
                       ¦  \\// \   | __)_   |  \  \ /  |  |  |
                       `---\/   \  |    ¬\  |  ¦\  /   |  Ї  |
                            l____\ l______\ `--' \/    l_____¦

                       ---------------------------------------
                       @{"Проект" link "project"}  @{"Действия" link "actions"}  @{"Импорт" link "import"}  @{"Экспорт" link "export"}

 @{b}Фильтр@{ub} :      Позволяет редактировать только те строки, которые
                соответствуют заданному шаблону. Вы можете использовать
                символ "*" вместо "#?".
                Горячая клавиша: "f".

 @{b}Выполнено@{ub} :   Показывает в процентах выполненую работу.

 @{b}Номер@{ub} :       Показывает текущую строку.

 @{b}Вывод@{ub} :       Позволяет выводить все или не переведённые элементы
                в каталоге (в последнем режиме, переведённые строки будут
                исчезать после перевода).
                Горячая клавиша : "a".

 @{b}Элементы@{ub} :    Показывает количество элементов, находящихся в
                каталоге.

 @{b}Буква "e"@{ub} :   Позволяет редактировать выбранную строку.

 @{b}Буква "c"@{ub} :   Позволяет скопировать выбранную строку.

 @{b}Буква "T"@{ub} :   Позволяет использовать текстовый редактор.

 @{b}Информация@{ub} :

  - @{fg shine}\el@{fg text} текст по левому краю
  - @{fg shine}\ec@{fg text} центровать текст
  - @{fg shine}\er@{fg text} текст по правому краю
  - @{fg shine}\eb@{fg text} утолщённый
  - @{fg shine}\eu@{fg text} подчёркнутый
  - @{fg shine}\ei@{fg text} наклонный
  - @{fg shine}\e1@{fg text} белый цвет
  - @{fg shine}\e0@{fg text} чёрный цвет
  - @{fg shine}\en@{fg text} обычный
  - @{fg shine}\n@{fg text}  конец строки
  - @{fg shine}\t@{fg text}  табуляция

@EndNode


@Node "Project" "Меню:Проект"

 @{b}Открыть каталог@{ub}       : Открытие каталогов любого вида.

 @{b}Сохранить каталог@{ub}     : Сохранение текущего каталога.

 @{b}Информация о каталоге@{ub} : Вывод некоторой информации о каталоге:
                              - Имя автора  (только для зарегистрированных
                                пользователей).
                              - Имя каталога.
                              - Используемый язык (для зарегистрированных,
                                пользователей, системный язык используется
                                как основной).
                              - Версия каталога.
                              - Характеристика каталога.

 @{b}О программе@{ub}           : Информация о TransCat и о регистрации.


 @{b}Выход@{ub}                 : Выход из TransCat.
@EndNode

@Node "Actions" "Меню: Действия"

 @{b}3aпoлнить пycтыe cтpoки@{ub} : Те строки, которые не были изменены
                  будут помечены как изменённые. 

 @{b}Перейти на строку@{ub}       : Переход на заданную строку в каталоге.
@EndNode

@Node "Import" "Меню: Импорт"

 @{b}Описание каталога@{ub} : Открытие файла с описанием каталога (.cd),
                       в основном используется авторами программ.

 @{b}Перевод каталога@{ub} : Открытие файла с переводом каталога (.ct),
                       который, возможно, создали Вы.
@EndNode

@Node "Export" "Меню: Экспорт"

 @{b}Описание каталога@{ub} : Сохранение описания каталога.

 @{b}Перевод каталога@{ub} : Сохранение перевода каталога.
                       (Только для зарегистрированных пользователей)

 @{b}Для ASM@{ub}   :    Сохранение файла с параметрами для Ассемблера.

 @{b}Для C@{ub}     :    Сохранение файла с параметрами для C.

 @{b}Для E@{ub}     :    Сохранение файла с параметрами для E.

 @{b}Для Blitz@{ub} :    Сохранение файла с параметрами для Blitz.

@EndNode

@Node "The Future" "Что планируется в будущем..."

  - Автор ждёт Ваших предложений !!!!!!!!

@EndNode

@Node "History" "Этапы создания TransCat"

 @{U}Версия 1.21@{uU} :

  - TransCat может грузить каталоги с командной строки
     (например: TransCat TransCat.catalog).

 @{U}Версия 1.20@{uU} :

  - Добавлен редактор тектса (очень полезно для комплексных фраз)

 @{U}Версия 1.14@{uU} :

  - Добавлен пункт "Поймать каталог" - Перехват каталогов программ во время
    загрузки программ.

 @{U}Версия 1.13@{uU} :

  - Исправлен глюк, проявляющийся с каталогами, длина которых больше 5Кб.

 @{U}Версия 1.12@{uU} :

  - Добавлен режим поиск/замена (работает автоматически).
  - Исправлен глюк, проявляющийся при чтении некоторых каталогов.

 @{U}Версия 1.01@{uU} :

  - Исправлен глюк, связанный с созданием файла описания.

 @{U}Версия 1.00@{uU} :

  - Первая версия на Aminet.

@EndNode

@Node "Translation" "Перевод программы."

 Для TransCat доступны следующие переводы :

  - Французский : Перевод каталога     : Автор
                  Перевод документации : Автор

  - Английский  : Перевод каталога     : Pascal Rullier
                  Перевод документации : Millot Lionel
                  Перевод документации : Schaaij Willem

  - Немецкий    : Перевод каталога     : Dirk Neubauer
                  Перевод документации : Dirk Neubauer

  - Испанский   : Перевод каталога     : Fermнn Venegas
                  Перевод документации : Fermнn Venegas

  - Итальянский : Перевод каталога     : Virginio Savani
                  Перевод документации : Virginio Savani

  - Венгерский  : Перевод каталога     : Garami Ferenc

  - Русский     : Перевод каталога     : Александр Дышкант
                  Перевод документации : Александр Дышкант

 Если Вы хотите перевести на документацию и/или каталог для TransCat,
 отправьте запрос @{"Автору" link "Contact"} и он Вам вышлет файлы с
 описанием каталога (.cd).
@EndNode

@Node "Contact" "Адрес Автора..."

  Вы можете отправить открытку по адресу :

      @{b}K L A X@{ub}
      P.O Box 14
      21601 Longvic CEDEX
      France

 или по Email  : rcilm021@dial.oleane.com

 или найти Автора на 
 IrcName : zIgUS ( on #artbas )
@EndNode

