/*========================================
 $VER: IC_ImageFX 1.0 (17.11.95) © NasGûl
 =========================================
 Ce Script lance ImageFX sur l'écran de
 ImageCat.
 =======================================*/

Address Command

'Run >NIL: <NIL: ImageFX:ImageFX WB PubScreen ImageCatScreen'



