/*======================================
 $VER: IC_PPShow 1.0 (17.11.95) © NasGûl
 =======================================
 Ce script utilise PPShow a la place du
 viewer défini par le tooltype VIEWER.
 =====================================*/

Parse arg f

Address Command 'PPShow NOMOUSE 'f

