/*==========================
 $VER: IC_Shell 1.0 © NasGûl
 ===========================
 Ce script ouvre un Shell sur l'écran de ImageCat.
 =========================*/

Address Command
'NewShell "Con:0/0/640/90/AmigaShell/Close/Screen ImageCatScreen"'

