/*==============================
 $VER: IC_SlideShow 1.0 © NasGûl
 =============================*/

Parse arg file
Address Command
'VT 'file' Hide Delay 5 NoBusy'


