/* Test Arexx Port - JWAREXXPORT */

address JWAREXXPORT

OPTIONS RESULTS

say 'Arexx now listening to JWAREXXPORT....'

'Hello'

say 'The Result-String from JWAREXXPORT: 'result

'Goodbye'

say 'The Result-String from JWAREXXPORT: 'result

say 'JWAREXXPORT now Closed - Arexx has stopped listening to JWAREXXPORT.'
