/* ARexx script to get UDP_Chat log into a UDP_Chat Server */
/* For use with AmiComSys 1.12+ */
/* $VER: UDP_Chat2.rexx 1.0 (11.05.98) Anton Reinauer */



ADDRESS "UDP_Chat"
QUIT   /* Send host name of person selected 
 				       in list, to connect to. */

EXIT;
