/*
 * SimpleRexx test...
 *
 */

Options FailAt 100

Options Results

Address CHELP1 closewindow


Address CHELP1 look openwindow

Address CHELP1 openwindow

