
   name      : Jd Date$
   parameters: 
   function  : read systemdate
   result    : date-string "DD.MM.YY"
   syntax    : A$=Jd Date$
   example   :   

   name      : Jd Setdate
   parameters: date-string "DD.MM.YY"
   function  : set systemdate
   result    : 
   syntax    : Jd Setdate "TT.MM.JJ"
   example   : 

   name      : Jd Setclock
   parameters: time-String "HH:MM:SS"
   function  : set systemtime
   result    : 
   syntax    : Jd Setclock "HH:MM:SS"
   example   : 

   name      : Jd Time$
   parameters: 
   function  : read systemtime
   result    : time-string "HH:MM:SS"
   syntax    : A$=Jd Time$
   example   : 

   name      : Jd Actual Date$
   parameters: datum-strings 1 and 2
   function  : get most actual datum
   result    : actual date
   syntax    : A$=Jd Actual Date$(date1$,date2$)
   example   : 

   name      : Jd Actual Time$
   parameters: time-strings 1 and 2
   function  : get actual time
   result    : actual time
   syntax    : A$=Jd Actual Time$(time1$,time2$)
   example   : 

   name      : Jd Secstime$
   parameters: seconds
   function  : seconds to time-string
   result    : time-string
   syntax    : T$=Jd Secstime$(secs)
   example   : 

   name      : Jd Timesecs
   parameters: time-string
   function  : time-string to seconds
   result    : seconds
   syntax    : S=Jd Timesecs(time$)
   example   : 

   name      : Jd Area First
   parameters: 
   function  : get first element out of an area
   result    : first element
   syntax    : X=Jd Area First
   example   : 

   name      : Jd Area Last
   parameters: 
   function  : get last element out of an area
   result    : last element
   syntax    : X=Jd Area Last
   example   : 

   name      : Jd Get Area
   parameters: area-string
   function  : get first and last element out of an area-string
   result    : 
   syntax    : Jd Get Area "string"
   example   : Jd Get Area "10-20" -> Jd Area First=10, Jd Area Last=20
              Jd Get Area "10-"   -> Jd Area First=10, Jd Area Last=0
              Jd Get Area "-20"   -> Jd Area First=0 , Jd Area Last=20
              Jd Get Area "10"    -> Jd Area First=10, Jd Area Last=10

   name      : Jd Limit
   parameters: number, lowest number and highest number
   function  : is number in between area
   result    : 0=no / 1=yes
   syntax    : X=Jd Limit(Z,Z1,Z2)
   example   : X=Jd Limit(-3,-8,10) -> X=1

   name      : Jd Reset Area
   parameters: 
   function  : deletes first and last element out of an area
   result    : 
   syntax    : Jd Reset Area
   example   : Jd Reset Area

   name      : Jd Get Number
   parameters: numberodds and number of digits
   function  : input-routine for numbers
   result    : number
   syntax    : X=Jd Get Number
   example   : 

   name      : Jd Get string$
   parameters: stringodds and max. len
   function  : input-routine with editing-functions
               Cursor left   = 1 position left
               Cursor right  = 1 position right
               Backspace     = delete letter left of Cursor
               Del           = delete letter under Cursor
               Amiga  F      = Cursor on first position
               Amiga  L      = Cursor on last position
               Amiga  R      = get stringodds
               Amiga  S      = save momentarily input-string
               Amiga  U      = get last saved input-string
               Amiga  X      = delete momentarily input-string
   result    : string
   syntax    : X=Jd Get string$("odds",LEN)
   example   : 

   name      : Jd Keypress
   parameters: 
   function  : get actual pressed key (incl. special keys)
   result    : actual keycode
   syntax    : T=Jd Keypress
   example   : 

   name      : Jd Keywait
   parameters: allowed keys
   function  : wait for one of the allowed keys
   result    : ASCII-value of key
   syntax    : X=Jd Keywait
   example   : X=Jd Keywait("12345") -> X=49 oder 50 oder ... 53

   name      : Jd Mwait
   parameters: 
   function  : wait for mousebutton
   result    : 1=left button / 2=right button
   syntax    : X=Jd Mwait
   example   : 

   name      : Jd Wait Amiga
   parameters: 
   function  : wait for combination of Amiga/key
   result    : ASCII-value of key
   syntax    : X=Jd Wait Amiga
   example   : 

   name      : Jd Wait Event
   parameters: 
   function  : wait for mousebutton or keypress
   result    : 
   syntax    : Jd Wait Event
   example   : 

   name      : Jd Moff Click
   parameters: 
   function  : get mousebutton (even after Jd Multi Off)
   result    : 1/2/3 = left/right/both buttons
   syntax    : MT=Jd Moff Click
   example   : 

   name      : Jd Moff Key
   parameters: 
   function  : get keypress (even after Jd Multi Off)
   result    : keycode
   syntax    : T=Jd Moff Key
   example   : 

   name      : Jd Double Click
   parameters: 
   function  : get double click (even after Jd Multi Off)
   result    : 1/2 = left/right button
   syntax    : DC=Jd Double Click
   example   : 

   name      : Jd Checksum
   parameters: sector-string
   function  : calc checksum of a sector (not for bootblocks)
   result    : checksum
   syntax    : Jd Checksum(A$)
   example   : A$=Jd Read Sector(0,880) : B=Jd Checksum(A$)

   name      : Jd Bootchecksum
   parameters: bootsector-string
   function  : al checksum for a bootblock
   result    : bootchecksum
   syntax    : Jd Bootchecksum(A$)
   example   : A$=Jd Read Sector(0,0)+Jd Read Sector(0,1)
               B=Jd Bootchecksum(A$)

   name      : Jd Diskchange
   parameters: 
   function  : wait for a diskchange
   result    : 
   syntax    : Jd Diskchange
   example   : 

   name      : Jd Odd
   parameters: number
   function  : check if number is even or odd
   result    : 0/1 = even/odd
   syntax    : Jd Odd(X)
   example   : A=Jd Odd(2) -> A=1

   name      : Jd Checkprt
   parameters: 
   function  : check if printer is available
   result    : 0/1/2/3 = ok/off/offline/no paper
   syntax    : Jd Checkprt
   example   : 

   name      : Jd Crypt$
   parameters: string
   function  : crypt a string (for german sorting)
   result    : coded string
   syntax    : A$=Jd Crypt$(B$)
   example   : 

   name      : Jd Encrypt$
   parameters: coded string
   function  : encrypting a string
   result    : string
   syntax    : A$=Jd Encrypt(B$)
   example   : 

   name      : Jd Cut$
   parameters: string, position and number of letters
   function  : deletes number of letters from position out of a string
   result    : new string
   syntax    : A$=Jd Cut$(B$)
   example   : A$=Jd Cut$("Test",2,2) -> A$="Tt"

   name      : Jd Insert$
   parameters: string, position and insert
   function  : inserts a string from position into another string
   result    : new string
   syntax    : A$=Jd Insert$(B$)
   example   : A$=Jd Insert$("Tt",2,"es") -> A$="Test"

   name      : Jd Skip$
   parameters: string
   function  : deletes leading and ending blanks from a string
   result    : new string
   syntax    : A$=Jd Skip$(B$)
   example   : A$=Jd Skip$("  Test  ") -> A$="Test"

   name      : Jd Extend$
   parameters: string, len and kind
   function  : extend a string
   result    : extended string
   syntax    : A$=Jd Extend$(B$,L,A)
   example   : A$=Jd Extend$("Test",8,0)  -> A$="  Test  ")
              A$=Jd Extend$("Test",8,1)  -> A$="    Test")
              A$=Jd Extend$("Test",8,-1) -> A$="Test    ")

   name      : Jd Exval$
   parameters: number and len [,"0" or " "]
   function  : extend number with "0" or " "
   result    : extended string
   syntax    : A$=Jd Exval$(B,L[,"0"])
   example   : A$=Jd Exval$(12,4,"0") -> A$="0012")

   name      : Jd Firstup$
   parameters: string
   function  : make first letter of all words capitals
   result    : changed string
   syntax    : A$=Jd Firstup$(B$)
   example   : A$=Jd Firstup$("ein test") -> A$="Ein Test"

   name      : Jd Change$
   parameters: string
   function  : change capital and small letters
   result    : changed string
   syntax    : A$=Jd Change$(B$)
   example   : A$=Jd Change$("Test") -> A$="tEST"

   name      : Jd Paste$
   parameters: string, instring and pastestring
   function  : paste part of a string
   result    : changed string
   syntax    : A$=Jd Paste$(B$,C$,D$)
   example   : A$=Jd Paste$("Test","es","a") -> A$="Tat"

   name      : Jd Rol$
   parameters: string
   function  : rotate a string one letter to the left
   result    : new string
   syntax    : A$=Jd Rol$(B$)
   example   : A$=Jd Rol$("Word") -> A$="ordW"

   name      : Jd Ror$
   parameters: string
   function  : rotate a string one letter to the right
   result    : new string
   syntax    : A$=Jd Ror$(B$)
   example   : A$=Jd Ror$("Word") -> A$="dWor"

   name      : Jd Compare
   parameters: string and pattern
               * = Joker for some letters
               ? = Joker for one letter
   function  : check if pattern fits the string
   result    : 0=no / 1=yes
   syntax    : X=Jd Compare(A$,B$)
   example   : X=Jd Compare("Test-string","*t-S*) -> X=1

   name      : Jd Count
   parameters: string and instring
   function  : count how many times instring is in string
   result    : quantity
   syntax    : X=Jd Count(A$,B$)
   example   : X=Jd Count("Test-string","t") -> X=2

   name      : Jd Dump$
   parameters: string
   function  : convert a memory-strings into a writeable
   result    : string
   syntax    : A$=Jd Dump$(B$)
   example   : 

   name      : Jd Linstr
   parameters: string and instring
   function  : get last instring
   result    : last occurance
   syntax    : L=Jd Linstr(S$,I$)
   example   : L=Jd Linstr("tester","te") -> L=4

   name      : Jd Detab
   parameters: string and tabvalue
   function  : exchange tabs with blanks
   result    : new string
   syntax    : N$=Jd Detab(O$,TW)
   example   : 

   name      : Jd Percent
   parameters: Percent (- 100) and Number (- 65535/$FFFF) >INTEGER!
   function  : get percentual result
   result    : percentual result
   syntax    : X#=Jd Percent(P,W)
   example   : X#=Jd Percent(9,91) -> X#=8,19

   name      : Jd Deoct
   parameters: Octalstring
   function  : change octalstring to decimal number
   result    : decimal number
   syntax    : X=Jd Deoct(O$)
   example   : X=Jd Deoct(&-20) -> X=16

   name      : Jd Oct$
   parameters: number [and len]
   function  : convert number to an octalstring
   result    : octal-string
   syntax    : A$=Jd Oct$(X[,len])
   example   : A$=Jd Oct$(-16,4) -> A$="&-0020"

   name      : Jd E#
   parameters: 
   function  : 
   result    : E# (=2.7182817)
   syntax    : 
   example   : 

   name      : Jd Pi#
   parameters: 
   function  : 
   result    : Pi# (=3.1415927) in AMOS 3.1415922
   syntax    : 
   example   : 

   name      : Jd Asl
   parameters: quantity and number
   function  : like in assembler
   result    : changed number
   syntax    : A=Jd Asl(A,Z)
   example   : 

   name      : Jd Asr
   parameters: quantity and number
   function  : like in assembler
   result    : changed number
   syntax    : A=Jd Asr(A,Z)
   example   : 

   name      : Jd Lsl
   parameters: quantity and number
   function  : like in assembler
   result    : changed number
   syntax    : A=Jd Lsl(A,Z)
   example   : 

   name      : Jd Lsr
   parameters: quantity and number
   function  : like in assembler
   result    : changed number
   syntax    : A=Jd Lsr(A,Z)
   example   : 

   name      : Jd Rol
   parameters: quantity and number
   function  : like in assembler
   result    : changed number
   syntax    : A=Jd Rol(A,Z)
   example   : 

   name      : Jd Ror
   parameters: quantity and number
   function  : like in assembler
   result    : changed number
   syntax    : A=Jd Ror(A,Z)
   example   : 

   name      : Jd Roxl
   parameters: quantity and number
   function  : like in assembler
   result    : changed number
   syntax    : A=Jd Roxl(A,Z)
   example   : 

   name      : Jd Roxr
   parameters: quantity and number
   function  : like in assembler
   result    : changed number
   syntax    : A=Jd Roxr(A,Z)
   example   : 

   name      : Jd Eqv
   parameters: number1 and number2
   function  : equivalent of two numbers
   result    : equivalent
   syntax    : A=Jd Eqv(Z1,Z2)
   example   : 

   name      : Jd Imp
   parameters: number1 and number2
   function  : implikation of two numbers
   result    : implikation
   syntax    : A=Jd Imp(Z1,Z2)
   example   : 

   name      : Jd Read Sector
   parameters: device and sector
   function  : read disk-sector
   result    : sector-string
   syntax    : A$=Jd Read Sector(D,S)
   example   : A$=Jd Read Sector(0,880) -> A$=RootBlock

   name      : Jd Write Sector
   parameters: write sector-string (len=512!), device and sector
   function  : writes a sector to disk
   result    : 0/-1 = ok/error
   syntax    : A=Jd Write Sector(A$,D,S)
   example   : A=Jd Write Sector(A$,0,880)

   name      : Jd Install
   parameters: drive
   function  : installs a disk
   result    : 0=ok / 1=error
   syntax    : F=Jd Install(D)
   example   : 

   name      : Jd Format
   parameters: drive and name
   function  : formats a disk
   result    : 0=ok / 1=error
   syntax    : F=Jd Format(D,N$)
   example   : 

   name      : Jd Shortformat
   parameters: drive and name
   function  : formats a disk short
   result    : 0=ok / 1=error
   syntax    : F=Jd Shortformat(D,N$)
   example   : 

   name      : Jd Copy
   parameters: file and new location
   function  : copies a File
   result    : 0=ok / 1=error
   syntax    : F=Jd Copy(QF$,ZF$)
   example   : 

   name      : Jd Hardware$
   parameters: 
   function  : write all hardware-devices into a string
   result    : harware-device-string
   syntax    : A$=Jd Hardware$
   example   : A$=Jd Hardware$ -> A$="DF1:DF0:PRT:PAR:SER:RAW:CON:RAM:"

   name      : Jd Volume$
   parameters: 
   function  : write all volume-names into a string
   result    : volume-string
   syntax    : A$=Jd Volume$
   example   : A$=Jd Volume$ -> A$="RAM DISK:ALF:BootRam:"

   name      : Jd Logical$
   parameters: 
   function  : write all logical-devices into a string
   result    : logical-devices-string
   syntax    : A$=Jd Logical$
   example   : A$=Jd Logical$ -> A$="ENV:T:S:L:C:FONTS:DEVS:LIBS:SYS:"

   name      : Jd File Size
   parameters: filename
   function  : get len of a file
   result    : filelen
   syntax    : L=Jd File Size(F$)
   example   : L=Jd File Size("AMOSPro") -> L=113516

   name      : Jd File Type
   parameters: file
   function  : get type of a file
   result    : positive=directory/negative=file/0=error
   syntax    : T=Jd File Type(F$)
   example   : 

   name      : Jd File Protection
   parameters: file
   function  : get protection-bits of a file
   result    : %HSPARWED (HSPA=high active/RWED=low active)
   syntax    : P=Jd File Protection(F$)
   example   : 

   name      : Jd File Comment$
   parameters: file
   function  : get comment of a file
   result    : comment-string
   syntax    : C$=Jd File Comment$(F$)
   example   : 

   name      : Jd Set Protection
   parameters: file and protection-bits
   function  : set protection-bits for a file
   result    : 0=error
   syntax    : F=Jd Set Protection(F$,%HSPARWED)
   example   : 

   name      : Jd Set Comment
   parameters: file and comment
   function  : set comment for a file
   result    : 0=error
   syntax    : F=Jd Set Comment(F$,K$)
   example   : 

   name      : Jd Count Dirs
   parameters: Path
   function  : count quantity of directories
   result    : quantity
   syntax    : A=Jd Count Dirs("Pfad")
   example   : 

   name      : Jd Count Files
   parameters: Path
   function  : count quantity of files
   result    : quantity
   syntax    : A=Jd Count Files("Pfad")
   example   : 

   name      : Jd Textfont
   parameters: fontname and Fontsize
   function  : set font for writing with >>Text<< or >>Jd Print<<
   result    : 
   syntax    : Jd Textfont "siesta.font",8
   example   : 

   name      : Jd Char X
   parameters: 
   function  : width of the graphic-font
   result    : width
   syntax    : B=Jd Char X
   example   : 

   name      : Jd Char Y
   parameters: 
   function  : height of the graphic-font
   result    : height
   syntax    : H=Jd Char Y
   example   : 

   name      : Jd Screen Planes
   parameters: 
   function  : number of bitplanes of the screen
   result    : number of bitplanes
   syntax    : X=Jd Screen Planes
   example   : 

   name      : Jd Rastport
   parameters: 
   function  : get address of the rastport
   result    : address
   syntax    : A=Jd Rastport
   example   : 

   name      : Jd Video On
   parameters: 
   function  : switches the monitor display on
   result    : 
   syntax    : Jd Video On
   example   : 

   name      : Jd Video Off
   parameters: 
   function  : switches the monitor display off
   result    : 
   syntax    : Jd Video Off
   example   : 

   name      : Jd Distance
   parameters: X1, Y1, X2 and Y2
   function  : calc distance between two points
   result    : distance
   syntax    : D=Jd Distance(X1,Y1 to X2,Y2)
   example   : 

   name      : Jd Arcus
   parameters: X1, Y1, X2 and Y2
   function  : calc angle between two points
   result    : angle
   syntax    : W=Jd Arcus(X1,Y1 to X2,Y2)
   example   : 

   name      : Jd X Pos
   parameters: X, Y, distance and angle
   function  : calc new X-position out of distance and angle
   result    : X-position
   syntax    : X2=Jd X Pos(X,Y,R,W)
   example   : 

   name      : Jd Y Pos
   parameters: X, Y, distance and angle
   function  : calc new Y-position out of distance and angle
   result    : Y-position
   syntax    : Y2=Jd X Pos(X,Y,R,W)
   example   : 

   name      : Jd Spread
   parameters: string, direction and delay
   function  : centeres a string
   result    : 
   syntax    : Jd Spread "string",direction,delay
   example   : Jd Spread "string",-1,D
                                     ri
                                    trin
                                   string
               Jd Spread "string",1,D
                                     Sg
                                    Stng
                                   string

   name      : Jd Squash
   parameters: string, direction and delay
   function  : centeres a  string
   result    : 
   syntax    : Jd Squash "string",direction,delay
   example   : Jd Squash "string",-1,D
                                   string
                                    trin
                                     ri
               Jd Squash "string",1,D
                                   string
                                    Stng
                                     Sg

   name      : Jd Tscroll
   parameters: string, direction and delay
   function  : scrolls a string
               positive direction >>>>>>>>
                <<<<<<<< negative direction
               ends by a keypress or a mousebutton
   result    : 
   syntax    : Jd Tscroll "string",direction,delay
   example   : 

   name      : Jd Hexdump
   parameters: Byte=1/Word=2/Long=4, startaddress, quantity and width
   function  : writes a hexdump
   result    : 
   syntax    : Jd Hexdump BWL,S,A,B
   example   : 

   name      : Jd Type
   parameters: string, delay and sound
   function  : writes a string like a typewriter
   result    : 
   syntax    : Jd Type "string",D,0/1
   example   : 

   name      : Jd Print
   parameters: string
   function  : writes a string with a loaded font
   result    : 
   syntax    : Jd Print "string"
   example   : 

   name      : Jd Draw Segment
   parameters: X-, Y-coordinate, X-, Y-radius, starting and ending angle
   function  : draws a circle or an elippse segment
   result    : 
   syntax    : Jd Draw Segment X,Y,XR,YR,SW,EW
   example   : 

   name      : Jd Spline
   parameters: X-, Y-start, X-, Y-end, X-, Y-controll and steprate
   function  : draws a curve
   result    : 
   syntax    : Jd Spline XS,YS,XE,YE,XK,YK,SR
   example   : 

   name      : Jd Draw Angle
   parameters: X, Y, len, angle
   function  : draw a line
   result    : 
   syntax    : Jd Draw Angle X,Y,L,W
   example   : 

   name      : Jd Slide X
   parameters: sourcescreen and destinationscreen
   function  : copies a Screen
   result    : 
   syntax    : Jd Slide X QS to ZS
   example   : 

   name      : Jd Slide Y
   parameters: sourcescreen and destinationscreen
   function  : copies a screen
   result    : 
   syntax    : Jd Slide Y QS to ZS
   example   : 

   name      : Jd Slide Up
   parameters: sourcescreen and destinationscreen
   function  : copies a screen
   result    : 
   syntax    : Jd Slide Up QS to ZS
   example   : 

   name      : Jd Slide Down
   parameters: sourcescreen and destinationscreen
   function  : copies a screen
   result    : 
   syntax    : Jd Slide Down QS to ZS
   example   : 

   name      : Jd Slide Left
   parameters: sourcescreen and destinationscreen
   function  : copies a screen
   result    : 
   syntax    : Jd Slide Left QS to ZS
   example   : 

   name      : Jd Slide Right
   parameters: sourcescreen and destinationscreen
   function  : copies a screen
   result    : 
   syntax    : Jd Slide Right QS to ZS
   example   : 

   name      : Jd Reset
   parameters: 
   function  : system-reset
   result    : 
   syntax    : Jd Reset
   example   : 

   name      : Jd Largest Chip Free
   parameters: 
   function  : get largest free chipmem
   result    : largest free chipmem
   syntax    : LCF=Jd Largest Chip Free
   example   : 

   name      : Jd Largest Fast Free
   parameters: 
   function  : get largest free fastmem
   result    : largest free fastmem
   syntax    : LFF=Jd Largest Fast Free
   example   : 

   name      : Jd Ppfind Mem
   parameters: endaddress of a loaded PowerPacker-data-file
   function  : calc the needed memory for decrunch
   result    : needed amount of memory
   syntax    : BSG=Jd PPfind Mem(E)
   example   : 

   name      : Jd Ppdecrunch
   parameters: starting-, ending- and destination-address
   function  : decrunch a PowerPacker-data-file
   result    : 
   syntax    : Jd Ppdecrunch S,E,Z
   example   : 

   name      : Jd Flush
   parameters: 
   function  : delete all unneeded libs, devs, fonts, etc.
   result    : 
   syntax    : Jd Flush
   example   : 

   name      : Jd Get Tab
   parameters: 
   function  : get tab len
   result    : tablen
   syntax    : TL=Jd Get Tab
   example   : 

   name      : Jd Multi On
   parameters: 
   function  : switches multitasking on
   result    : 
   syntax    : Jd Multi On
   example   : 

   name      : Jd Multi Off
   parameters: 
   function  : switches multitasking off
   result    : 
   syntax    : Jd Multi Off
   example   : 

   name      : Jd Dled On
   parameters: 
   function  : switches drive-LED on
   result    : 
   syntax    : Jd Dled On
   example   : 

   name      : Jd Dled Off
   parameters: 
   function  : switches drive-LED off
   result    : 
   syntax    : Jd Dled Off
   example   : 

   name      : Jd Reduce Dim
   parameters: array and new dimension
   function  : REDUCES a dimension (max. 20)
   result    : 
   syntax    : Jd Reduce Dim ARRAY(VAR(0)),ND
   example   : 

   name      : Jd Reset Dim
   parameters: array
   function  : re-set a dimension
   result    : 
   syntax    : Jd Reset Dim ARRAY(VAR(0))
   example   : 

   name      : Jd Array Swap
   parameters: array, var no.1 and var no.2
   function  : swaps variables in an array
   result    : 
   syntax    : Jd Array Swap ARRAY(VAR(0)),VN1,VN2
   example   : 

   name      : Jd Array Clear
   parameters: array
   function  : delete all variables in an arrray
   result    : 
   syntax    : Jd Array Clear ARRAY(VAR(0))
   example   : 

   name      : Jd Array$ Clear
   parameters: array
   function  : delete all variables in a string array
   result    : 
   syntax    : A=ARRAY(VAR$(A)) : Jd Array Clear A
   example   : 

   name      : Jd Grey Colour
   parameters: colour value
   function  : converts colour in grey
   result    : greytone
   syntax    : GS=Jd Grey Colour(RGB)
   example   : 

   name      : Jd Antique Colour
   parameters: colour value
   function  : converts colour in brown
   result    : browntone
   syntax    : BS=Jd Antique Colour(RGB)
   example   : 

   name      : Jd Pseudo Palette
   parameters: 
   function  : makes a pseudo palette
   result    : 
   syntax    : Jd Pseudo Palette
   example   : 

   name      : Jd Spread Palette
   parameters: startinf and ending colourno.
   function  : spread a colour into another
   result    : 
   syntax    : Jd Spread Palette SF To EF
   example   : 

   name      : Jd Complement Colour
   parameters: colour value
   function  : calc complementcolour
   result    : complementcolour
   syntax    : KF=Jd Complement Colour(RGB)
   example   : 

   name      : Jd False Colour
   parameters: colour value
   function  : calc false colour
   result    : false colour
   syntax    : FF=Jd False Colour(RGB)
   example   : 

   name      : Jd Negative Colour
   parameters: colour value
   function  : calc negative colour
   result    : negative colour
   syntax    : NF=Jd Negative Colour(RGB)
   example   : 

   name      : Jd Mix Colours
   parameters: colour value1 and colour value2
   function  : mix two colours
   result    : mixed colour
   syntax    : MF=Jd Mix Colours(F1,F2)
   example   : 

   name      : Jd Red Value
   parameters: colour value
   function  : calc the red-part
   result    : red-part
   syntax    : R=Jd Red Value(RGB)
   example   : 

   name      : Jd Green Value
   parameters: colour value
   function  : calc the green-part
   result    : green-part
   syntax    : G=Jd Green Value(RGB)
   example   : 

   name      : Jd Blue Value
   parameters: colour value
   function  : calc the blue-part
   result    : blue-part
   syntax    : B=Jd Blue Value(RGB)
   example   : 

   name      : Jd Rgb Value
   parameters: red-, green- and blue-part
   function  : clac colour out of RGB-parts
   result    : colour
   syntax    : F=Jd Rgb Value(R,G,B)
   example   : 

   name      : Jd Separate Black
   parameters: colour value
   function  : separate blackform
   result    : blackform-colour
   syntax    : SF=Jd Separate Black(RGB)
   example   : 

   name      : Jd Separate Blue
   parameters: colour value
   function  : separate blueform
   result    : blueform-colour
   syntax    : BF=Jd Separate Blue(RGB)
   example   : 

   name      : Jd Separate Green
   parameters: colour value
   function  : separate greenform
   result    : greenform-colour
   syntax    : GF=Jd Separate Green(RGB)
   example   : 

   name      : Jd Separate Red
   parameters: colour value
   function  : separate redform
   result    : redform-colour
   syntax    : RF=Jd Separate Red(RGB)
   example   : 

   name      : Jd Separate Yellow
   parameters: colour value
   function  : separate yellowform
   result    : yellowform-colour
   syntax    : GF=Jd Separate Yellow(RGB)
   example   : 

   name      : Jd Separate Magenta
   parameters: colour value
   function  : separate magentaform
   result    : magentaform-colour
   syntax    : MF=Jd Separate magenta(RGB)
   example   : 

   name      : Jd Separate Cyan
   parameters: colour value
   function  : separate cyanform
   result    : cyanform-colour
   syntax    : CF=Jd Separate cyan(RGB)
   example   : 

   name      : Jd Tone Colour
   parameters: colourno. and [-]factor
   function  : brighten or darken a colour
   result    : 
   syntax    : Jd Tone Colour NR,F
   example   : 

   name      : Jd Swap Colours
   parameters: colourno.1 and colourno.2
   function  : exchange two colours
   result    : 
   syntax    : Jd Swap Colours FNR1,FNR2
   example   : 

   name      : Jd Copy Colour
   parameters: colourno.1 and colourno.2
   function  : copies a colour
   result    : 
   syntax    : Jd Copy Colour NR1 to NR2
   example   : 

   name      : Jd Grid
   parameters: X1, Y1, width, height, X- and Y-step
   function  : draw a grid
   result    : 
   syntax    : Jd Grid X1,Y1,B,H,XS,YS
   example   : 

   name      : Jd Screen Convert
   parameters: sourcescreen,sourcemode,destinationscreen and destinationmode
   function  : convert a Screen
               Lowres       to Hires          $0    to $8000
               Lowres       to Lowres+Laced   $0    to $4
               Hires        to Lowres         $8000 to $0
               Hires        to Hires+Laced    $8000 to $8004
               Lowres+Laced to Hires+Laced    $4    to $8004
               Lowres+Laced to Lowres         $4    to $0
               Hires+Laced  to Lowres+Laced   $8004 to $4
               Hires+Laced  to Hires          $8004 to $8000
   result    : 
   syntax    : Jd Screen Convert S,SM to D,DM
   example   : 

   name      : Jd Load Palette
   parameters: filename
   function  : load a palette (32 colours)
   result    : 
   syntax    : Jd Load Palette FILE$
   example   : 

   name      : Jd Save Palette
   parameters: filename
   function  : save a palette (32 colours)
   result    : 
   syntax    : Jd Save Palette FILE$
   example   : 

   name      : Jd Guru
   parameters: Text1 and Text2
   function  : PseudoGuru
   result    : mouse button
   syntax    : MT=Jd Guru(T1$,T2$)
   example   : 

   name      : Jd Xoffset
   parameters: 
   function  : get X-offset of the screen
   result    : X-offset
   syntax    : X=Jd Xoffset
   example   : 

   name      : Jd Yoffset
   parameters: 
   function  : get Y-offset of the screen
   result    : Y-offset
   syntax    : Y=Jd Yoffset
   example   : 

   name      : Jd Find
   parameters: array, searchstring [and starting position within the array]
   function  : searches for a string in an array [from position]
               jokers are allowed
   result    : position
   syntax    : A=ARRAY(VAR$(0)) : P=Jd Find(ARRAY,S$[,POS]
   example   : 

   name      : Jd Change Colours
   parameters: Col1, Col2, X1, Y1, X2 and Y2
   function  : exchange two colours (palette will not be changed!)
   result    : 
   syntax    : Jd Change Colours COL1,COL2,X1,Y1 To X2,Y2
   example   : 

   name      : Jd Fill Colour
   parameters: NewCol, OldCol, X1, Y1, X2 and Y2
   function  : change a colour (palette will not be changed!)
   result    : 
   syntax    : Jd Fill Colour NCOL To OCOL,X1,Y1 To X2,Y2
   example   : 

   name      : Jd Private
   parameters: 
   function  : ILLEGAL-instruction for a debugger
   result    : 
   syntax    : Jd Private
   example   : 

   name      : Jd Exdatazone
   parameters: extension-No.
   function  : address of the datazone of an extension
   result    : address of the datazone
   syntax    : DZA=Jd Exdatazone(NR)
   example   : 

   name      : Jd Leap Year
   parameters: year
   function  : is year a leap year?
   result    : -1/0 = yes/no
   syntax    : SJ=Jd Leap Year(year)
   example   : 

   name      : Jd Day Of Year
   parameters: day, month, year
   function  : what's the day of the year?
   result    : day
   syntax    : T=Jd Day Of Year(T,M,J)
   example   : 

   name      : Jd Day
   parameters: day, month, year
   function  : what's the day of the week?
   result    : 1-7 = sunday-saturday
   syntax    : WT=Jd Day(T,M,J)
   example   : 

   name      : Jd Day$
   parameters: day (1-7)
   function  : name of the day
   result    : day
   syntax    : day$=Jd Day$(WEEKDAY)
   example   : 

   Jd Prt Reset                   -> reset printer

   Jd Prt Init                    -> init printer

   Jd Prt Italics                 -> italics

   Jd Prt Italics Off             -> italics off

   Jd Prt Under                   -> underline

   Jd Prt Under Off               -> underline off

   Jd Prt Bold                    -> bold

   Jd Prt Bold Off                -> bold off

   Jd Prt Elite                   -> 96  CPI

   Jd Prt Elite Off               -> 80  CPI

   Jd Prt Fine                    -> 136 CPI

   Jd Prt Fine Off                -> 80  CPI

   Jd Prt Enlarged                -> wide

   Jd Prt Enlarged Off            -> wide off

   Jd Prt Shadow                  -> shadow

   Jd Prt Shadow Off              -> shadow off

   Jd Prt Double                  -> doublestrike

   Jd Prt Double Off              -> doublestrike off

   Jd Prt Nlq                     -> NLQ

   Jd Prt Nlq Off                 -> Pica

   Jd Prt Super                   -> Superscript

   Jd Prt Super Off               -> Superscript off

   Jd Prt Sub                     -> Subscript

   Jd Prt Sub Off                 -> Subscript off

   Jd Prt Set Us                  -> US letters

   Jd Prt Set French              -> French letters

   Jd Prt Set German              -> German letters

   Jd Prt Set Uk                  -> UK letters

   Jd Prt Set Danishi             -> Danish I letters

   Jd Prt Set Sweden              -> Swedish letters

   Jd Prt Set Italian             -> Italian letters

   Jd Prt Set Spanish             -> Spanish letters

   Jd Prt Set Japanese            -> Japanese letters

   Jd Prt Set Norge               -> Norwegian letters

   Jd Prt Set Danishii            -> Danish II letters

   Jd Prt Prop                    -> proportional

   Jd Prt Prop Off                -> proportional off

   Jd Prt Ljustify                -> left justification

   Jd Prt Rjustiy                 -> right justification

   Jd Prt Fjustify                -> full justification

   Jd Prt Center                  -> center justification

   Jd Prt Lspace Eight            -> 1/8 linespace

   Jd Prt Lspace Six              -> 1/6 linespace

   Jd Prt Justify Off             -> no justification

   Jd Prt Pline Up        +Wert   -> set partial line up

   Jd Prt Pline Down      +Wert   -> set partial line down

   Jd Prt Set Lmargin     +Wert   -> set left border

   Jd Prt Set Rmargin     +Wert   -> set right border

   Jd Prt Set Tmargin     +Wert   -> set top border

   Jd Prt Set Bmargin     +Wert   -> set bottom border

   Jd Prt Clr Margins             -> delete borders

   Jd Prt Set Htab        +Wert   -> set horizontal-tab

   Jd Prt Set Vtab        +Wert   -> set vertikal-tab

   Jd Prt Clr Htab                -> delete horizontal-tab

   Jd Prt Clr Htabs               -> delete all horizontal-tabs

   Jd Prt Clr Vtab                -> delete vertikal-tab

   Jd Prt Clr Vtabs               -> delete all vertikal-tabs

   Jd Prt Set Def Tabs            -> default tabs

   name      : Jd Dayval
   parameters: datestring
   function  : get value of day
   result    : value of day
   syntax    : T=Jd Dayval("TT.MM.JJJJ")
   example   : 

   name      : Jd Monthval
   parameters: datestring
   function  : get value of month
   result    : value of month
   syntax    : M=Jd Monthval("TT.MM.JJJJ")
   example   : 

   name      : Jd Yearval
   parameters: datestring
   function  : get value of year
   result    : value of year
   syntax    : J=Jd Yearval("TT.MM.JJJJ")
   example   : 

   name      : Jd Mouse
   parameters: 
   function  : number of Show/Hide
   result    : <0 = hidden / >=0 = shown
   syntax    : SHW=Jd Mouse
   example   : Hide : Hide : SHW=Jd Mouse => SHW=-2

   name      : Jd Setoutput Amiga
   parameters: 
   function  : changes output-format to AMIGA-standard
   result    : 
   syntax    : Jd Setoutput Amiga
   example   : 

   name      : Jd Setoutput Amos
   parameters: 
   function  : changes output-format to AMOS-standard
   result    : 
   syntax    : Jd Setoutput Amos
   example   : 

   name      : Jd Lightest Colour
   parameters: 
   function  : get number of the brightest colour
   result    : colourno.
   syntax    : LC=Jd Lightest Colour
   example   : 

   name      : Jd Darkest Colour
   parameters: 
   function  : get number of the darkest colour
   result    : colourno.
   syntax    : DC=Jd Darkest Colour
   example   : 

   name      : Jd Rprint
   parameters: string
   function  : write a string right justified
   result    : 
   syntax    : Jd Rprint S$
   example   : 

   name      : Jd Fit
   parameters: number and divisor
   function  : check if number/divisor is an integer
   result    : 0/1 = float/integer
   syntax    : E=Jd Fit(Z,D)
   example   : 

   name      : Jd Prt Shade
   parameters: Shade 0/1/2/3
   function  : set printer to b/w, grey1, colour oder grey2
   result    : 
   syntax    : Jd Prt Shade S
   example   : 

   name      : Jd Prt Aspect
   parameters: Aspect 0/1
   function  : set printer to horizontal/vertikal
   result    : 
   syntax    : Jd Prt Aspect A
   example   : 

   name      : Jd Prt Image
   parameters: Image 0/1
   function  : set printer to positiv/negativ
   result    : 
   syntax    : Jd Prt Image I
   example   : 

   name      : Jd Prt Threshold
   parameters: Threshold 1-15
   function  : set grey tones
   result    : 
   syntax    : Jd Prt Threshold T
   example   : 

   name      : Jd Prt Density
   parameters: Density 1-7
   function  : set printer density
   result    : 
   syntax    : Jd Prt Density D
   example   : 

   name      : Jd Screen Border
   parameters: colour, X1, Y1, X2 and Y2
   function  : clear screen outside an area
   result    : 
   syntax    : Jd Screen Border C,X1,Y1 To X2,Y2
   example   : 

   name      : Jd Wait Raster
   parameters: line (0-256)
   function  : wait for rasterline
   result    : 
   syntax    : Jd Wait Raster Z
   example   : 

