/* rx module test */

address AREXXTESTPORT

OPTIONS RESULTS

say 'En test....'

'bla'
say 'résultat='result
'quit'
say 'résultat='result

say 'C'est fait.'
